#################### ГЛАВНОЕ МЕНЮ ####################
welcome_message =
    <b>👋 { $name }, приветствуем в новостном боте Первой школы!
    Этот бот поможет Вам узнавать всю актуальную информацию о предстоящих событиях и нововведениях, включая изменения в расписании.

    📃 Не забывайте о соблюдении правил, которые закреплены в описании канала.

    ✨ Удобного пользования!</b>
#################### ГЛАВНОЕ МЕНЮ ####################

#################### КНОПКИ ####################
schedule_button_text = 📒 Расписание

profile_button_text = 📝 Профиль

news_button_text = 📑 Новости
#################### КНОПКИ ####################